import React from "react";
import { Menu } from ".";
import { Footer } from ".";
import { Row } from "react-bootstrap";
// import Footer from "./index";

function Image() {
  return (
    <Row>
      <img src="content_02.webp" alt="img_content2" className="img-content" />
    </Row>
  );
}

function Content() {
  return (
    <Row className="mt-3">
      <h1 className="font-title text-center">ข้าวหน้าเนื้อดงบุริ</h1>
      <p className="font-button mt-2">
        เมนูอาหารญี่ปุ่น ของ Youtuber ช่อง Chef Bas Fast Food
        ถอดแบบมาจากข้าวหน้าเนื้อญี่ปุ่นแท้ ๆ เลยก็ว่าได้ โดยเฉพาะในส่วนของซอสผัด
        ที่ใช้น้ำซุปดาชิ มิริน และ ซอสโชยุ เป็นส่วนผสม
        ซึ่งถ้าหากใครอยากทำให้เหมือนต้นฉบับ ทำตามสูตรนี้ได้เลย รับรองว่า
        ไม่ผิดหวัง
      </p>
      <p className="font-button fw-bold">ส่วนผสม</p>
      <ul className="font-button ms-5">
        <li>เนื้อใบพายสไลซ์ 250 กรัม</li>
        <li>ข้าวญี่ปุ่น 1 ถ้วย (ใช้ข้าวหอมมะลิแทนก็ได้)</li>
        <li>ไข่ไก่ 1 ฟอง (แช่เย็น)</li>
        <li>หอมหัวใหญ่ 1 หัว</li>
        <li>ต้นหอมญี่ปุ่น 1 ต้น</li>
        <li>ต้นหอม 3 ต้น</li>
        <li>น้ำซุปดาชิ 5 ช้อนโต๊ะ</li>
        <li>มิริน 2 ช้อนโต๊ะ</li>
        <li>สาเก 1 ช้อนโต๊ะ</li>
        <li>ซอสโชยุ 2 ช้อนโต๊ะ</li>
        <li>น้ำตาล 1 ช้อนชา</li>
        <li>พริกไทย นิดหน่อย</li>
      </ul>

      <p className="font-button fw-bold">วิธีทำ</p>
      <ol className="font-button ms-5">
        <li>ใช้มีดหั่นหอมหัวใหญ่ ต้นหอมญี่ปุ่น ต้นหอม เตรียมไว้</li>
        <li>
          ตั้งกระทะ เปิดไฟกลาง ใส่น้ำมันลงไป ตามด้วยหอมหัวใหญ่ ผัดให้สลดลง
          มีสีสุกใส
        </li>
        <li>
          ใส้เนื้อวัวลงไป ผัดให้เนื้อวัวสุก พอสุกแล้ว ให้ใส่มิริน สาเก ซอสโชยุ
          คลุกเคล้าให้เข้ากัน
        </li>
        <li>
          จากนั้น เติมน้ำซุปดาชิลงไป (ใช้ผงปลาโอแห้ง ผสมกับน้ำเปล่า) ในกระทะ
          โรยน้ำตาลลงไปเล็กน้อย แล้วนำฝาอบมาปิด เคี่ยวให้เนื้อวัวสุกทั่วกัน
        </li>
        <li>
          ใส่ต้นหอมญี่ปุ่นลงไป เคี่ยวให้น้ำซอสงวดลง พองวดลงดีแล้ว
          ให้ตักเฉพาะเนื้อขึ้นมา โปะลงบนข้าว ตอกไข่ไก่ แยกเอาเฉพาะไข่แดง
          วางไว้ตรงกลาง โรยหน้าด้วยต้นหอมซอย งาขาวคั่ว
          แล้วราดด้วยน้ำซอสที่อยู่ในกระทะ เป็นอันเสร็จ
        </li>
      </ol>
    </Row>
  );
}
export default function FoodList2() {
  return (
    <>
      <Menu />
      <Image />
      <Content />
      <Footer />
    </>
  );
}
